{
    'title': 'Johannes Reuter',
    'subtitle': 'Web Developer',
    'sections': {
        'about_me': {
            'title': 'Über mich',
            'paragraphs': [
                'Hallo, ich bin Johannes Reuter, freischaffender Web-Entwickler aus Karlsruhe. Studiert habe ich an der Hochschule für Technik und Wirtschaft.',
                'Durch meine Projekte habe ich vor allem eins gelernt: Es ist sehr wichtig, in Bewegung zu bleiben. Die ganze Welt, und das Web im Besonderen, ist in stetigem Wandel. An diese Veränderungen muss man sich ständig anpassen, um erfolgreich zu sein und zu bleiben.',
                'Daher ist meine Philosophie: <strong>keep up to date!</strong> Es gibt jeden Tag zu viel Neues zu entdecken und zu lernen, um im Bett zu bleiben.'
            ],
            'portraitURL': 'portrait.jpg'
        },
        'projects': {
            'title': 'Projekte',
            'slideshow': [
                {
                    'name': 'air.de',
                    'subtitle': 'Umsetzung einer modernen, <br />responsiven Oberfläche <br />für alle Endgeräte',
                    'url': 'www.air.de',
                    'imageURL': 'airde.png',
                    'tags': [
                        'CSS3',
                        'Responsive Design',
                        'HTML5',
                        'JavaScript'
                    ]
                },
                {
                    'name': 'Scrumteam',
                    'subtitle': 'Umsetzung einer frischen, <br />aufgeräumten Website <br />mit Buchungsverwaltung',
                    'url': 'www.dasscrumteam.com',
                    'imageURL': 'scrumteam.png',
                    'tags': [
                        'CSS3',
                        'HTML5',
                        'JavaScript',
                        'PHP-Backend'
                    ]
                },
                {
                    'name': 'Seminaut',
                    'subtitle': 'Erweiterung und Konzeption<br />von Oberfläche<br />und Geschäftslogik',
                    'url': 'www.seminaut.de',
                    'imageURL': 'seminaut.png',
                    'tags': [
                        'CSS3',
                        'Responsive Design',
                        'HTML5',
                        'PHP-Backend',
                        'PDF-Generierung'
                    ]
                },
                {
                    'name': 'Sunnycars-Modul',
                    'subtitle': 'Konzeption und Umsetzung <br />der Oberfläche und Anbindung <br />über PHP per XML-Schnittstelle',
                    'url': 'www.urlaubswerk.de',
                    'imageURL': 'mietwagen.png',
                    'tags': [
                        'CSS3',
                        'AJAX',
                        'JavaScript',
                        'PHP-Backend',
                        'XML-API'
                    ]
                }
            ]
        },
        'skills': {
            'title': 'Skills',
            'technologies': [
                {
                    'name': 'HTML5',
                    'description': 'Standard für moderne Websites mit Features wie lokale Datenbanken oder Mikrofon und Kamera-Zugriff.',
                    'level': 3,
                    'imageURL': 'html5.png'
                },
                {
                    'name': 'Java<wbr />Script',
                    'description': 'Ermöglicht Programmierung komplexer Anwendungen, die direkt im Browser laufen',
                    'level': 4,
                    'imageURL': 'javascript.png'
                },
                {
                    'name': 'CSS3',
                    'description': 'Styling und Aussehen von Websites. Unterstützt Animationen und 3D-Effekte.',
                    'level': 4,
                    'imageURL': 'css3.png'
                },
                {
                    'name': 'JQuery',
                    'description': 'JavaScript-Framework, bietet zahlreiche Möglichkeiten zur Oberflächengestaltung',
                    'level': 3,
                    'imageURL': 'jquery.png'
                },
                {
                    'name': 'MySQL',
                    'description': 'Datenbank-Sprache, ermöglicht die Formulierung komplexer Daten-Abfragen.',
                    'level': 3,
                    'imageURL': 'mysql.png'
                },
                {
                    'name': 'Canvas',
                    'description': 'HTML5-Element zum Zeichnen im Browser (z.B. 2D-Spiele oder Diagramm-Grafiken)',
                    'level': 2,
                    'imageURL': 'canvas.png'
                },
                {
                    'name': 'PHP',
                    'description': 'Serverseitige Sprache zum Programmieren von Anwendungslogik (Nutzer-Authorisierung etc.)',
                    'level': 4,
                    'imageURL': 'php.png'
                },
                {
                    'name': 'Angular',
                    'description': 'JavaScript-Framework, das schnelles Entwickeln von gut strukturierten Anwendungen ermöglicht.',
                    'level': 2,
                    'imageURL': 'angular.png'
                },
                {
                    'name': 'Word<wbr />press',
                    'description': 'Blog-Verwaltungstool, wird eingesetzt, um die Inhalte von Blogs oder Websites komfortabel im Browser zu verwalten.',
                    'level': 2,
                    'imageURL': 'wordpress.png'
                }
            ]
        },
        'contact': {
            'title': 'Kontakt',
            'paragraphs': [
                'Bei Fragen oder Anmerkungen erreicht man mich durch folgende Kanäle:'
            ],
            'channels': [
                {
                    'icon': 'envelope-o',
                    'text': 'email@johannes-reuter.de',
                    'link': 'mailto:email@johannes-reuter.de'
                },
                {
                    'icon': 'mobile',
                    'text': '0176 / 914 952 71',
                    'link': 'tel:017691495271'
                },
                {
                    'icon': 'github',
                    'text': 'flash1293',
                    'link': 'https://github.com/flash1293'
                },
                {
                    'icon': 'facebook',
                    'text': 'Johannes Reuter',
                    'link': 'https://www.facebook.com/johannes.reuter.739'
                },
                {
                    'icon': 'reddit',
                    'text': 'curian17',
                    'link': 'http://www.reddit.com/user/curian17'
                }
            ]
        },
        'imprint': {
            'title': 'Impressum',
            'paragraphs': [
                '<h3>Angaben gemäß § 5 TMG</h3>',
                'Johannes Reuter<br />Elbinger Str 4c<br />76139 Karlsruhe',
                '<h3>Quellenangaben für die verwendeten Bilder und Grafiken</h3>',
                '<a href="https://www.flickr.com/photos/klausnahr/7712207650/sizes/l/">https://www.flickr.com/photos/klausnahr/7712207650/sizes/l/</a><br />Klaus Nahr',
                '<h3>Datenschutzerklärung für die Nutzung von Google Analytics</h3>',
                'Diese Website benutzt Google Analytics, einen Webanalysedienst der Google Inc. ("Google"). Google Analytics verwendet sog. "Cookies", Textdateien, die auf Ihrem Computer gespeichert werden und die eine Analyse der Benutzung der Website durch Sie ermöglichen. Die durch den Cookie erzeugten Informationen über Ihre Benutzung dieser Website werden in der Regel an einen Server von Google in den USA übertragen und dort gespeichert. Im Falle der Aktivierung der IP-Anonymisierung auf dieser Webseite wird Ihre IP-Adresse von Google jedoch innerhalb von Mitgliedstaaten der Europäischen Union oder in anderen Vertragsstaaten des Abkommens über den Europäischen Wirtschaftsraum zuvor gekürzt.',
                'Nur in Ausnahmefällen wird die volle IP-Adresse an einen Server von Google in den USA übertragen und dort gekürzt. Im Auftrag des Betreibers dieser Website wird Google diese Informationen benutzen, um Ihre Nutzung der Website auszuwerten, um Reports über die Websiteaktivitäten zusammenzustellen und um weitere mit der Websitenutzung und der Internetnutzung verbundene Dienstleistungen gegenüber dem Websitebetreiber zu erbringen. Die im Rahmen von Google Analytics von Ihrem Browser übermittelte IP-Adresse wird nicht mit anderen Daten von Google zusammengeführt.',
                'Sie können die Speicherung der Cookies durch eine entsprechende Einstellung Ihrer Browser-Software verhindern; wir weisen Sie jedoch darauf hin, dass Sie in diesem Fall gegebenenfalls nicht sämtliche Funktionen dieser Website vollumfänglich werden nutzen können. Sie können darüber hinaus die Erfassung der durch das Cookie erzeugten und auf Ihre Nutzung der Website bezogenen Daten (inkl. Ihrer IP-Adresse) an Google sowie die Verarbeitung dieser Daten durch Google verhindern, indem sie das unter dem folgenden Link verfügbare Browser-Plugin herunterladen und installieren: http://tools.google.com/dlpage/gaoptout?hl=de.',
                'Quelle: <a href="http://www.e-recht24.de/">http://www.e-recht24.de/</a>'
            ],
        },
    }
}
